import { Container, PageTitle } from "@/components/shared";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "MelodyMind — Политика конфиденциальности",
};

export default function PrivacyPolicyPage() {
  return (
    <Container className="">
      <PageTitle title="Политика конфиденциальности" className="mt-10 mb-5" />
      <p className="text-sm text-muted-foreground mb-5">
        Последнее обновление: 05 сентября 2024 г.
      </p>
      <p>
        MelodyMind Inc. обязуются защищать Вашу (термин “Вы” или “Ваш” также
        применяется к Вам независимо от того, действуете ли Вы в своем личном
        качестве или как уполномоченный представитель исполнителя, группы,
        коллективного объединения или корпорации, в этом случае “Вы” или “Ваш”
        относится к исполнителю, группе, коллективному объединению или
        корпорации, от имени которых Вы действуете и уполномочены действовать)
        конфиденциальность в Интернете. Мы также стремимся предоставить Вам
        максимально возможный опыт работы на нашем веб-сайте по адресу
        https://melodymind.tw1.ru, а также на всех связанных сайтах и других веб
        сервисах, которые позволяют посетителям веб-сайта получать доступ от
        нашего имени, включая проигрыватели, виджеты, инструменты и другие
        услуги, предоставляемые MelodyMind (совместно именуемые
        &#34;Услуги&#34;). Эта Политика конфиденциальности объясняет типы
        персональных данных, которые мы собираем от посетителей веб-сайта и
        других людей, с которыми мы общаемся и взаимодействуем в ходе
        предоставления Услуг. В настоящей Политике конфиденциальности также
        описано, как мы используем Ваши персональные данные, цель их передачи и
        получатели Персональных данных, а также Ваши права и выбор, связанные с
        этими данными.
      </p>
      <h1 className="text-lg font-bold my-8">
        Используя MelodyMind, Вы соглашаетесь с практикой, описанной в настоящей
        Политике конфиденциальности
      </h1>
      <p>В настоящей Политике конфиденциальности объясняется следующее:</p>
      <ul className="list-disc">
        <li className="ml-8">Определения</li>
        <li className="ml-8">Роли</li>
        <li className="ml-8">Сбор персональных данных</li>
        <li className="ml-8">Использование персональных данных</li>
        <li className="ml-8">Обмен персональными данными</li>
        <li className="ml-8">Безопасность и хранение</li>
        <li className="ml-8">Передача данных</li>
        <li className="ml-8">Ваши права и выбор</li>
        <li className="ml-8">
          Политика использования файлов cookie и реклама, основанная на
          интересах
        </li>
        <li className="ml-8">Ссылки на другие веб-сайты</li>
        <li className="ml-8">Защита данных в соответствии с юрисдикцией</li>
        <li className="ml-8">
          Изменения в настоящей Политике конфиденциальности
        </li>
        <li className="ml-8">Связаться с нами</li>
      </ul>
      <p className="my-8">
        Пожалуйста, ознакомьтесь с нашей Политикой использования файлов cookie
        для получения информации, касающейся использования нами файлов cookie и
        аналогичных технологий отслеживания. Если Вы являетесь клиентом с
        нарушением зрения или другой инвалидностью, или клиентом, который
        обращается за поддержкой на другом языке, вы можете ознакомиться с
        Политикой конфиденциальности MelodyMind, отправив электронное сообщение
        по адресу mm.business@internet.ru.
      </p>
      <p className="pb-8">
        Настоящая Политика конфиденциальности применяется к любому Сайту и
        Сервису, которые ссылаются на настоящую Политику конфиденциальности.
        Настоящая Политика не распространяется на сторонние веб-сайты, продукты
        или услуги, даже если они ссылаются на наш Сайт или Услуги. Мы
        рекомендуем Вам ознакомиться с политикой конфиденциальности этих третьих
        лиц, прежде чем подключать свою учетную запись MelodyMind или делиться
        какими-либо личными данными. Мы также рекомендуем Вам ознакомиться с
        этой Политикой конфиденциальности, чтобы понять, как будут
        обрабатываться Ваши персональные данные, когда Вы будете в полной мере
        пользоваться нашими Услугами. Если в настоящей Политике
        конфиденциальности не определено иное, термины с заглавной буквы,
        используемые в настоящей Политике конфиденциальности, имеют те же
        значения, что и в наших Условиях предоставления услуг. Пользуясь
        Услугами, Вы соглашаетесь на сбор и использование информации в
        соответствии с настоящей Политикой конфиденциальности. Мы просим Вас не
        пользоваться Услугами, если Вы не согласны с каким-либо из положений
        настоящей Политики конфиденциальности. Вы также можете написать нам по
        адресу, если у вас возникнут дополнительные вопросы или потребуется
        дополнительная информация после прочтения этого документа.
      </p>
      <h1 className="text-lg font-bold">
        I. <span className="underline">Определения</span>
      </h1>
      <div className="ml-8">
        <div className="my-4">
          <h1 className="font-bold">Личные данные</h1>
          <p>
            “Персональные данные” означают любую информацию, относящуюся к
            идентифицированному или поддающемуся идентификации физическому лицу.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Обработка</h1>
          <p>
            “Обработка” означает любую операцию или набор операций, которые
            выполняются с персональными данными или с наборами персональных
            данных, независимо от того, автоматизированы они или нет, такие как
            сбор, запись, организация, структурирование, хранение, адаптация или
            изменение, извлечение, консультирование, использование, раскрытие
            путем передачи, распространения или иным образом. доступно,
            выравнивание или комбинация, ограничение, стирание или уничтожение.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Профилирование</h1>
          <p>
            “Профилирование” означает любую форму автоматизированной обработки
            персональных данных, состоящую из использования персональных данных
            для оценки определенных личных аспектов, относящихся к физическому
            лицу, в частности для анализа или прогнозирования аспектов,
            касающихся производительности этого физического лица на работе,
            экономического положения, здоровья, личных предпочтений, интересов,
            надежности, поведения, местоположение или перемещения.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Данные об использовании</h1>
          <p>
            “Данные об использовании” – это данные, собираемые автоматически
            либо при использовании Сервисов, либо из самой инфраструктуры
            Сервисов (например, продолжительность посещения страницы).
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Cookies</h1>
          <p>
            “Cookies” – это текстовые файлы, размещаемые на Вашем компьютере для
            сбора стандартной информации интернет-журнала и информации о
            поведении посетителей.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Контролер данных</h1>
          <p>
            “Контролер данных” означает физическое или юридическое лицо,
            государственный орган, агентство или другой орган, который
            самостоятельно или совместно с другими определяет цели, для которых
            и каким образом обрабатываются или должны обрабатываться любые
            персональные данные. Для целей настоящей Политики конфиденциальности
            MelodyMind является контролером Ваших данных.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">
            Обработчик данных (или поставщики услуг)
          </h1>
          <p>
            “Обработчик данных (или поставщик услуг)“ означает физическое или
            юридическое лицо (не являющееся сотрудником Контролера данных),
            которое обрабатывает данные от имени Контролера данных. Мы можем
            использовать услуги различных поставщиков услуг для более
            эффективной обработки Ваших данных.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Субъект данных</h1>
          <p>
            “Субъект данных“ – это любое живое физическое лицо, которое является
            субъектом персональных данных.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Пользователь</h1>
          <p>
            “Пользователь“ – это физическое лицо, пользующееся нашими Услугами.
            Пользователь соответствует Субъекту данных, который является
            субъектом персональных данных.
          </p>
        </div>
        <div className="my-4">
          <h1 className="font-bold">Согласие</h1>
          <p>
            “Согласие” Субъекта данных означает любое свободно данное,
            конкретное, информированное и недвусмысленное указание на пожелания
            субъекта данных, которое он или она выражает заявлением или четким
            позитивным действием
          </p>
        </div>
      </div>
    </Container>
  );
}
